# PANDAS
### Чтение данных

In [32]:
import pandas as pd
import numpy as np

In [33]:
np.set_printoptions(precision=2)

In [34]:
data = pd.read_csv('beauty.csv', sep= ';')

In [35]:
type(data)

pandas.core.frame.DataFrame

In [36]:
data.head()

    wage  exper  union  goodhlth  black  female  married  service  educ  looks
0   5.73     30      0         1      0       1        1        1    14      4
1   4.28     28      0         1      0       1        1        0    12      3
2   7.96     35      0         1      0       1        0        0    10      4
3  11.57     38      0         1      0       0        1        1    16      3
4  11.42     27      0         1      0       0        1        0    16      3

In [37]:
data.shape

(1260, 10)

In [38]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1260 entries, 0 to 1259
Data columns (total 10 columns):
wage        1260 non-null float64
exper       1260 non-null int64
union       1260 non-null int64
goodhlth    1260 non-null int64
black       1260 non-null int64
female      1260 non-null int64
married     1260 non-null int64
service     1260 non-null int64
educ        1260 non-null int64
looks       1260 non-null int64
dtypes: float64(1), int64(9)
memory usage: 98.6 KB

In [39]:
data.describe()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
count,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000
mean,6.306690,18.206349,0.272222,0.933333,0.073810,0.346032,0.691270,0.273810,12.563492,3.185714
std,4.660639,11.963485,0.445280,0.249543,0.261564,0.475892,0.462153,0.446089,2.624489,0.684877
min,1.020000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,5.000000,1.000000
25%,3.707500,8.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,12.000000,3.000000
50%,5.300000,15.000000,0.000000,1.000000,0.000000,0.000000,1.000000,0.000000,12.000000,3.000000
75%,7.695000,27.000000,1.000000,1.000000,0.000000,1.000000,1.000000,1.000000,13.000000,4.000000
max,77.720000,48.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,17.000000,5.000000

In [40]:
data['exper']

0       30
1       28
2       35
3       38
4       27
        ..
1255    25
1256     4
1257    35
1258    15
1259    24
Name: exper, Length: 1260, dtype: int64

# loc и iloc

In [41]:
data.loc[0: 5, ['wage', 'female']]

    wage  female
0   5.73       1
1   4.28       1
2   7.96       1
3  11.57       0
4  11.42       0
5   3.91       1

In [42]:
data.iloc[:, 2:4].head()

   union  goodhlth
0      0         1
1      0         1
2      0         1
3      0         1
4      0         1

In [43]:
data[data['female'] == 1]['wage'].mean(), \
data[data['female'] ==0]['wage'].mean()

(4.299357798165136, 7.3688228155339734)

### Это был средний доход женщин и мужчин

In [44]:
data[(data['female'] == 0) & (data['married'] ==1)]['wage'].median(), \
data[(data['female'] == 0) & (data['married'] ==0)]['wage'].median()

(6.710000000000001, 5.0649999999999995)

### Это был отбор всех женатых мужчин, и подсчёт медианы размера заработной платы у женатых и не женатых мужчин

In [53]:
for look, sub_df in data.groupby(['looks', 'female']):
    print(look)
    # print(sub_df['female'].mean())

(1, 0)
(1, 1)
(2, 0)
(2, 1)
(3, 0)
(3, 1)
(4, 0)
(4, 1)
(5, 0)
(5, 1)

### look это элемент итератора и уникальное значение признака, sub_df подвыборка,где все значения уникального признака равны текущему значению

In [54]:
data.groupby('looks')[['wage', 'exper']].agg(np.mean)

           wage      exper
looks
1      4.621538  27.000000
2      5.328803  18.922535
3      6.504598  19.491690
4      6.299341  15.406593
5      7.388421  11.631579

In [55]:
pd.crosstab(data['female'], data['married'])

married    0    1
female
0        166  658
1        223  213

In [56]:
data['wage'].describe()

count    1260.000000
mean        6.306690
std         4.660639
min         1.020000
25%         3.707500
50%         5.300000
75%         7.695000
max        77.720000
Name: wage, dtype: float64

In [66]:
data['is_rich'] = (data['wage'] > data['wage'].quantile(.75)).astype('int64')

In [67]:
data.head()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks,is_rich
0,5.73,30,0,1,0,1,1,1,14,4,0
1,4.28,28,0,1,0,1,1,0,12,3,0
2,7.96,35,0,1,0,1,0,0,10,4,1
3,11.57,38,0,1,0,0,1,1,16,3,1
4,11.42,27,0,1,0,0,1,0,16,3,1

In [68]:
data['rubbish'] = .56*data['wage'] +0.32*data['exper']

In [70]:
data.apply(np.mean)

wage         6.306690
exper       18.206349
union        0.272222
goodhlth     0.933333
black        0.073810
female       0.346032
married      0.691270
service      0.273810
educ        12.563492
looks        3.185714
is_rich      0.250000
rubbish      9.357778
dtype: float64

In [71]:
def string_gender(female):
    return 'female' if female else 'male'

In [72]:
string_gender(17)

'female'

In [74]:
 data['female'].apply(lambda female: 'female' if female else 'male' )

0       female
1       female
2       female
3         male
4         male
         ...
1255    female
1256    female
1257    female
1258    female
1259    female
Name: female, Length: 1260, dtype: object